export const data =
"# Markdown 示例文本\n" +
"\n" +
"这是一段示例文本，演示了常见的 Markdown 功能。\n" +
"\n" +
"## 标题\n" +
"\n" +
"# Heading 1\n" +
"## Heading 2\n" +
"### Heading 3\n" +
"#### Heading 4\n" +
"##### Heading 5\n" +
"###### Heading 6\n" +
"\n" +
"## 强调和格式化\n" +
"\n" +
"*斜体*\n" +
"**加粗**\n" +
"~~删除线~~\n" +
"***斜体加粗***\n" +
"\n" +
"## 列表\n" +
"\n" +
"### 无序列表\n" +
"\n" +
"- 项目 1\n" +
"- 项目 2\n" +
"- 项目 3\n" +
"\n" +
"### 有序列表\n" +
"\n" +
"1. 项目 1\n" +
"2. 项目 2\n" +
"3. 项目 3\n" +
"\n" +
"## 链接和图片\n" +
"\n" +
"[链接文本](链接地址)\n" +
"\n" +
"![替代文本](图片地址)\n" +
"\n" +
"## 引用块\n" +
"\n" +
">这是一个引用块。\n" +
">您可以在其中引用文字、段落或其他内容。\n" +
"\n" +
"## 代码块\n" +
"\n" +
"单行代码：`console.log('Hello, World!');`\n" +
"\n" +
"多行代码块：\n" +
"\n" +
"```javascript\n" +
"单行\n"+
"function add(a, b) {\n" +
"  return a + b;\n" +
"}\n" +
"```\n" +
"\n" +
"# Markdown 示例文本\n" +
"\n" +
"这是一段示例文本，演示了常见的 Markdown 功能。\n" +
"\n" +
"## 表格\n" +
"\n" +
"Markdown 支持创建简单的表格：\n" +
"\n" +
"| 列 1 | 列 2 |\n" +
"|------|------|\n" +
"| 单元格 1 | 单元格 2 |\n" +
"| 单元格 3 | 单元格 4 |\n" +
"\n" +
"## 水平线\n" +
"\n" +
"您可以使用三个或更多的连字符、星号或下划线创建水平线：\n" +
"\n" +
"---\n" +
"\n" +
"***\n" +
"\n" +
"___\n" +
"\n" +
"这个示例文本包含了一个简单的表格和不同类型的水平线。您可以根据需要修改表格的列数和内容，并使用连字符、星号或下划线调整水平线的样式。\n" +
"\n" +
"以上是示例文本的部分内容，还有其他的 Markdown 功能可以用于创建格式化文档和内容。您可以将此示例文本保存为 `.md` 文件并在支持 Markdown 的编辑器或查看器中进行预览和编辑。\n";
